-- Заполнение таблиц базы данных Polyclinic

-- таблица видов изданий
insert into publications_types
    (type)
values
    ('газета'),   -- 1
    ('журнал'),   -- 2
    ('каталог'),  -- 3
    ('альманах'), -- 4
    ('атлас'),    -- 5
    ('дайджест'), -- 6
    ('гравюра');  -- 7

-- таблица изданий
insert into publications
    (pub_index, pub_name, type_id,unit_price)
values
    ('ПМ194','Вокруг света',1             , 1200),-- 1
    ('ПМ194','Наука и жизнь',1            , 950), -- 2
    ('ПМ194','Медицинская газета',1       , 2300),-- 3
    ('РВ234','actual de Geografía',5      , 3000),-- 4
    ('РВ234','atlas of the world ocean',5 , 1000),-- 5
    ('СТ343','Хочу всё знать',4           , 1350),-- 6
    ('СТ343','Литературный',4             , 1100),-- 7
    ('СТ343','Научный',4                  , 1500),-- 8
    ('П1968','Прикладная информатика',2   , 1600),-- 9
    ('В3245','Мебельный',3                , 500), -- 10
    ('Д3245','Автомобильный',3            , 850); -- 11

-- таблица подписок
insert into subscriptions
(/*_id,*/publication_id, date_start, duration)
values
    (/* 1,*/1 ,'2022-10-21',  1),   --  1
    (/* 2,*/2 ,'2022-10-21',  2),	--  2
    (/* 3,*/9 ,'2022-10-21',  3),	--  3
    (/* 4,*/2 ,'2022-10-22',  4),	--  4
    (/* 5,*/5 ,'2022-04-22',  4),	--  5
    (/* 6,*/5 ,'2022-01-31',  3),	--  6
    (/* 7,*/5 ,'2022-12-22',  2),	--  7
    (/* 8,*/6 ,'2022-10-23',  5),	--  8
    (/* 9,*/6 ,'2022-10-23',  6),	--  9
    (/*10,*/2 ,'2022-10-24',  9),	-- 10
    (/*11,*/2 ,'2022-12-22',  7),	-- 11
    (/*12,*/4 ,'2022-10-28',  3),	-- 12
    (/*13,*/4 ,'2022-10-28',  2),	-- 13
    (/*14,*/3 ,'2022-10-28',  4),	-- 14
    (/*15,*/9 ,'2022-11-02',  6);	-- 15



